xtee55/mediator-common-test/src/main/resources/sdsb-listMethods.request

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:sdsb="http://x-road.eu/xsd/sdsb.xsd"
        xmlns:id="http://x-road.eu/xsd/identifiers">
    <SOAP-ENV:Header>
        <sdsb:client id:objectType="MEMBER">
            <id:sdsbInstance>EE</id:sdsbInstance>
            <id:memberClass>GOV</id:memberClass>
            <id:memberCode>XTS4CLIENT</id:memberCode>
        </sdsb:client>
        <sdsb:service id:objectType="SERVICE">
            <id:sdsbInstance>EE</id:sdsbInstance>
            <id:memberClass>GOV</id:memberClass>
            <id:memberCode>XTS4CLIENT</id:memberCode>
            <id:serviceCode>listMethods</id:serviceCode>
        </sdsb:service>
        <sdsb:userId>...</sdsb:userId>
        <sdsb:id>411d6755661409fed365ad8135f8210be07613da</sdsb:id>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <sdsb:listMethods/>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>